ams/src/Documents/_ВозвратИзПереработки/_ВозвратИзПереработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_ВозвратИзПереработки</name>
  <basedOn>Document.ПриобретениеТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister._ТоварыПереданные</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Documents/AMS_ПередачаВПереработку/AMS_ПередачаВПереработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AMS_ПередачаВПереработку</name>
  <basedOn>Document.ПриобретениеТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister._ТоварыПереданные</registerRecords>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчикаЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчикаЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef._ВозвратИзПереработки</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеТоваров</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_ВидТранспортаПеревозчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_ДоверенностьКлиента</name>
    <comment>1 - Оригинал, 2 - Копия</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_НомерЗаявкиПеревозчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_ТелефонВодителяКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_ТранспортКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Documents/_ВозвратИзПереработки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПечатнойФормыМ15(ПараметрыПечати, МассивОбъектов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|   ПередачаВПереработку.Ссылка КАК ПередачаВПереработку,
	|   ПередачаВПереработку.ДокументПоступления
	|ПОМЕСТИТЬ втДокументыПоступления
	|ИЗ
	|   Документ.AMS_ПередачаВПереработку КАК ПередачаВПереработку
	|ГДЕ
	|   ПередачаВПереработку.Ссылка В (&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   ДокументыПоступления.ПередачаВПереработку,
	|   ПриобретениеТоваровУслугТовары.Номенклатура,
	|   МАКСИМУМ(ПриобретениеТоваровУслугТовары.Цена) КАК Цена
	|ПОМЕСТИТЬ втЦены
	|ИЗ
	|   Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДокументыПоступления КАК ДокументыПоступления
	|       ПО ПриобретениеТоваровУслугТовары.Ссылка = ДокументыПоступления.ДокументПоступления
	|
	|СГРУППИРОВАТЬ ПО
	|   ПриобретениеТоваровУслугТовары.Номенклатура,
	|   ДокументыПоступления.ПередачаВПереработку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   Шапка.Ссылка                                           КАК Ссылка,
	|   Шапка.Номер                                            КАК Номер,
	|   Шапка.Дата                                             КАК Дата,
	|   Шапка.Дата                                             КАК ДатаСоставления,
	|   Шапка.Контрагент                                       КАК Контрагент,
	|   Шапка.Организация                                      КАК Организация,
	|   Шапка.Организация.Префикс                              КАК Префикс,
	|   Шапка.ДокументПоступления.Представление                КАК Основание,
	|   Шапка.Склад                                            КАК Склад,
	|   Шапка.Склад.Наименование                               КАК СкладНаименование,
	|   Шапка.Подразделение                                    КАК СтруктурноеПодразделение,
	|   Шапка.ДокументПоступления.БанковскийСчетОрганизации    КАК БанковскийСчетОрганизации,
	|   Шапка.ДокументПоступления.Валюта                       КАК Валюта,
	|   ИСТИНА                                                 КАК ЦенаВключаетНДС,
	|   Шапка.Организация._Руководитель                        КАК Руководитель,
	|   Шапка.Организация._ДолжностьРуководителя               КАК ДолжностьРуководителя,
	|   Шапка.Организация._ГлавныйБухгалтер                    КАК ГлавныйБухгалтер,
	|   Шапка.Организация._Кладовщик                           КАК Кладовщик,
	|   Шапка.Организация._ДолжностьКладовщика                 КАК ДолжностьКладовщика,
	|   ЛОЖЬ                                                   КАК ЭтоПередачаНаКомиссию
	|ИЗ
	|   Документ.AMS_ПередачаВПереработку КАК Шапка
	|ГДЕ
	|   Шапка.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|   Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   Товары.Ссылка КАК Ссылка,
	|   Товары.Номенклатура,
	|   Товары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|   Товары.Номенклатура.Код КАК ТоварКод,
	|   ВЫБОР
	|       КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|           ТОГДА Товары.Номенклатура.ЕдиницаИзмерения.Представление
	|       ИНАЧЕ Товары.Упаковка.Представление
	|   КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|   ВЫБОР
	|       КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|           ТОГДА Товары.Номенклатура.ЕдиницаИзмерения.Код
	|       ИНАЧЕ Товары.Упаковка.ЕдиницаИзмерения.Код
	|   КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|   Товары.Характеристика,
	|   Товары.Характеристика.Наименование ХарактеристикаНаименование,
	|   Товары.Упаковка,
	|   Товары.Количество,
	|   0 КАК КоличествоМест,
	|   Цены.Цена,
	|   ЕСТЬNULL(Цены.Цена, 0) * ЕСТЬNULL(Товары.Количество, 0) КАК Сумма,
	|   ЕСТЬNULL(Цены.Цена, 0) * ЕСТЬNULL(Товары.Количество, 0) * 18 / 118 КАК СуммаНДС,
	|   Товары.НомерСтроки КАК НомерСтроки,
	|   ЛОЖЬ КАК ЭтоВозвратнаяТара
	|ИЗ
	|   Документ.AMS_ПередачаВПереработку.Товары КАК Товары
	|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЦены КАК Цены
	|       ПО Товары.Ссылка = Цены.ПередачаВПереработку
	|           И Товары.Номенклатура = Цены.Номенклатура
	|ГДЕ
	|   Товары.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|   Ссылка,
	|   НомерСтроки
	|ИТОГИ ПО
	|   Ссылка";

	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);

	ТаблицаКурсовВалют = ТаблицаКурсовВалют();

	МассивРезультатов = Запрос.ВыполнитьПакет();
	РезультатПоШапке = МассивРезультатов[2];
	РезультатПоТабличнойЧасти = МассивРезультатов[3];

	СтруктураДанныхДляПечати = Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти, ТаблицаКурсовВалют",
		РезультатПоШапке, РезультатПоТабличнойЧасти, ТаблицаКурсовВалют);

	Возврат СтруктураДанныхДляПечати;

КонецФункции

Функция ТаблицаКурсовВалют()
	ТаблицаКурсовВалют = Новый ТаблицаЗначений;
	ТаблицаКурсовВалют.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаКурсовВалют.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаКурсовВалют.Колонки.Добавить("Курс", Новый ОписаниеТипов("Число"));
	ТаблицаКурсовВалют.Колонки.Добавить("Кратность", Новый ОписаниеТипов("Число"));

	НоваяСтрока = ТаблицаКурсовВалют.Добавить();
	НоваяСтрока.Валюта    = Константы.ВалютаРегламентированногоУчета.Получить();
	НоваяСтрока.Дата      = ТекущаяДатаСеанса();
	НоваяСтрока.Курс      = 1;
	НоваяСтрока.Кратность = 1;

	Возврат ТаблицаКурсовВалют;
КонецФункции

#КонецОбласти

#КонецЕсли
